import { useState, Suspense } from 'react'
import { Canvas } from "@react-three/fiber"
import { useGLTF, Stage, PresentationControls, Loader } from "@react-three/drei"

function Model ({ model, ...props }) {
  const { scene } = useGLTF(model);
  return <primitive object={scene} {...props} />
}

const exhibitions = [
  {
    model: "zenit.glb",
    title: "Зенит Фотоснайпер ФС-3",
    description: (
      <>
      <p>
      Зенит-фотоснайпер ФС-3 — советская компактная фотокамера-шпион, разработанная в 1950-х годах для скрытой съёмки на больших расстояниях. Этот уникальный прибор использовался разведывательными службами для получения фотодокументов с секретных объектов и стал одним из символов технической изобретательности эпохи Холодной войны.
      </p>
      <h2 className="mt-4 mb-2 font-bold">Конструкция и характеристики:</h2>
      <ul className="list-disc ml-6 mb-4">
      <li>Камера оснащена длиннофокусным объективом с фокусным расстоянием около 300 мм, что позволяло вести съёмку с большого расстояния без обнаружения.</li>
      <li>Компактный и прочный корпус обеспечивал удобство скрытого ношения и быстрого использования в полевых условиях.</li>
      <li>Использовала плёнку формата 35 мм, что обеспечивало высокое качество фотографий для последующего анализа.</li>
      <li>Механический затвор и простая система управления позволяли быстро делать снимки даже в сложных условиях.</li>
      <li>Обеспечивала высокую точность фокусировки и минимальное искажение изображения.</li>
      </ul>
      <h2 className="mt-4 mb-2 font-bold">Историческое значение:</h2>
      <ul className="list-disc ml-6 mb-4">
      <li>ФС-3 широко применялась советскими разведчиками и агентами для скрытого фотографирования важных объектов, включая военные базы, промышленные предприятия и стратегические сооружения.</li>
      <li>Её использование позволило получать ценные разведданные, которые влияли на принятие решений в сфере национальной безопасности.</li>
      <li>Камера стала одним из первых специализированных фотоустройств, разработанных именно для задач шпионажа и разведки.</li>
      <li>ФС-3 демонстрирует уровень технической мысли и инженерного мастерства советской разведки в период Холодной войны.</li>
      </ul>
      <h2 className="mt-4 mb-2 font-bold">Значение для музея шпионажа:</h2>
      <ul className="list-disc ml-6 mb-4">
      <li>Экспонат позволяет посетителям увидеть, каким образом технические средства помогали в сборе секретной информации в эпоху глобального противостояния.</li>
      <li>ФС-3 — пример того, как инновации в области оптики и миниатюризации техники использовались в тайных операциях.</li>
      <li>Камера служит напоминанием о важности разведки и технологического превосходства в истории XX века.</li>
      </ul>
      <blockquote className="italic text-gray-400 mt-4 p-5 bg-gray-700/10 rounded-lg">
      «Точность и незаметность — вот главные качества, которыми обладал ФС-3, позволяя проникать в самые охраняемые тайны противника» — неизвестный советский инженер-разработчик.
      </blockquote>
      <p className="mt-4">
      Экспонат представлен в виде оригинального аппарата и служит уникальным свидетельством технической эры шпионских операций Холодной войны.
      </p>
      </>
    ),
  },
  {
    model: "nagant.glb",
    title: "Нагант 1895",
    description: (
      <>
      <p> Револьвер Нагант 1895 — легендарное шпионское оружие, ставшее символом надежности и скрытности в эпоху начала XX века. Этот семизарядный револьвер, разработанный бельгийскими оружейниками братьями Наганами и принятый на вооружение российской армии в 1895 году, широко использовался в разведывательных операциях благодаря своей неприхотливости и высокой боевой эффективности. </p> <h2 className="mt-4 mb-2 font-bold">Конструкция и характеристики:</h2> <ul className="list-disc ml-6 mb-4"> <li>Калибр 7,62 мм с уникальным патроном, гильза которого полностью скрывала пулю, обеспечивая надежную герметизацию и высокую мощность выстрела.</li> <li>Семизарядный барабан с механизмом, который перед выстрелом подавал барабан вперед, исключая прорыв пороховых газов и повышая безопасность стрелка.</li> <li>Два варианта ударно-спускового механизма: солдатский с ручным взведением курка и офицерский с самовзводом, что позволяло быстро вести огонь в критических ситуациях.</li> <li>Прочная и компактная конструкция с деревянными щечками рукояти и оксидированными стальными деталями, обеспечивавшая долговечность и удобство скрытого ношения.</li> <li>Высокая надежность и неприхотливость в эксплуатации, отсутствие задержек при осечках, что делало револьвер идеальным для тайных операций.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Историческое значение:</h2> <ul className="list-disc ml-6 mb-4"> <li>Револьвер Нагант 1895 активно применялся в разведке и шпионских миссиях в период Русско-японской, Первой мировой и Гражданской войн, а также в годы Великой Отечественной войны.</li> <li>Стал символом революции и Гражданской войны, а также одним из основных видов личного оружия офицерского и сержантского состава Красной Армии.</li> <li>Его конструктивные особенности и надежность позволяли использовать револьвер в условиях скрытности и быстрого реагирования, что было критично для разведывательных задач.</li> <li>Производство на Тульском оружейном заводе продолжалось до конца Великой Отечественной войны, что свидетельствует о его востребованности и эффективности.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Значение для музея шпионажа:</h2> <ul className="list-disc ml-6 mb-4"> <li>Экспонат демонстрирует, каким образом классическое огнестрельное оружие использовалось в тайных операциях и разведке в первой половине XX века.</li> <li>Револьвер Нагант 1895 — пример инженерной мысли и технической надежности, обеспечивавшей успех шпионских миссий и безопасность агентов.</li> <li>Позволяет посетителям понять роль личного оружия в обеспечении разведывательных операций и его влияние на ход военных конфликтов.</li> </ul> <blockquote className="italic text-gray-400 mt-4 p-5 bg-gray-700/10 rounded-lg"> «Надежность и скрытность — вот что делало Наган 1895 незаменимым оружием разведчика в самых опасных миссиях» — неизвестный советский разведчик. </blockquote> <p className="mt-4"> Экспонат представлен в оригинальном виде и служит уникальным свидетельством технической эры шпионских операций и военной истории XX века. </p>
      </>
    ),
  },
  {
    model: "bulgarian_umbrella.glb",
    title: "Болгарский зонт",
    description: (
      <>
      <p> Болгарский зонтик — уникальное шпионское оружие, ставшее символом скрытности и изощренности спецслужб эпохи Холодной войны. В 1978 году с его помощью был убит болгарский диссидент и писатель Георгий Марков в Лондоне: в ножку зонта была встроена капсула с ядом рицином, которая при уколе проникала в тело жертвы, вызывая смертельное отравление. </p> <h2 className="mt-4 mb-2 font-bold">Конструкция и характеристики:</h2> <ul className="list-disc ml-6 mb-4"> <li>Обычный складной зонтик с телескопическим металлическим каркасом и куполом из плотной ткани, внешне не отличимый от повседневного аксессуара.</li> <li>Внутри зонта скрывался специальный механизм с полым платиновым шариком диаметром менее 2 мм, наполненным ядом рицином.</li> <li>Капсула была запечатана веществом, растворяющимся при контакте с теплом человеческого тела, что обеспечивало скрытую доставку токсина в кровь.</li> <li>Механизм позволял незаметно уколоть жертву при касании зонтом, имитируя укус насекомого, что делало атаку практически неотличимой от случайного инцидента.</li> <li>Использование рицина — одного из самых сильных природных ядов, не имевшего в то время антидота, делало оружие особенно смертоносным и труднодоказуемым.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Историческое значение:</h2> <ul className="list-disc ml-6 mb-4"> <li>Болгарский зонтик стал орудием политического убийства Георгия Маркова — яркого критика коммунистического режима, что вызвало международный резонанс и символизировало методы борьбы спецслужб с диссидентами.</li> <li>Операция по устранению Маркова была тщательно спланирована и осуществлена болгарскими спецслужбами при содействии КГБ СССР, что отражает уровень технической и оперативной подготовки в эпоху Холодной войны.</li> <li>Этот случай стал одним из самых известных примеров использования скрытого оружия и ядов в разведывательной деятельности XX века.</li> <li>После раскрытия деталей дела «болгарский зонтик» превратился в символ тайных операций и изощренных методов устранения врагов режима.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Значение для музея шпионажа:</h2> <ul className="list-disc ml-6 mb-4"> <li>Экспонат демонстрирует, как повседневные предметы могут быть превращены в смертоносное оружие для скрытых операций и политических убийств.</li> <li>Зонтик служит наглядным примером инноваций в области миниатюризации и маскировки устройств для тайных операций спецслужб.</li> <li>Позволяет посетителям осознать масштабы и методы борьбы разведок в период Холодной войны, а также важность технического превосходства в шпионской деятельности.</li> </ul> <blockquote className="italic text-gray-400 mt-4 p-5 bg-gray-700/10 rounded-lg"> «Этот зонтик — не просто аксессуар, а смертоносное орудие, символизирующее тонкую грань между повседневностью и тайной войной разведок» — эксперт по истории шпионажа. </blockquote> <p className="mt-4"> Экспонат представлен в виде точной копии оригинального устройства и является уникальным свидетельством технической изобретательности и жестокости шпионских операций XX века. </p>
      </>
    )
  },
  {
    model: "sever.glb",
    title: "Радио - Север",
    description: (
      <>
      <p> Шпионское радио «Север» — малогабаритная радиостанция, разработанная в СССР в 1950-х годах специально для нужд разведки и тайных операций. Этот портативный передатчик позволял агентам передавать закодированные сообщения на большие расстояния, оставаясь незамеченными для противника. Благодаря своей компактности и надежности, «Север» стал неотъемлемым атрибутом советских разведчиков в годы Холодной войны. </p> <h2 className="mt-4 mb-2 font-bold">Конструкция и характеристики:</h2> <ul className="list-disc ml-6 mb-4"> <li>Компактный корпус размером с небольшую книгу, что позволяло легко прятать радиостанцию среди личных вещей или носить под одеждой.</li> <li>Работала на коротких волнах, обеспечивая дальность передачи до нескольких сотен километров в зависимости от условий и антенны.</li> <li>Питание осуществлялось от батарей или внешнего источника, что позволяло использовать устройство в полевых условиях и вне доступа к электросети.</li> <li>Простая схема управления: минимальное количество переключателей и ручек, что облегчало быструю настройку и использование даже в стрессовых ситуациях.</li> <li>Возможность передачи как голосовых, так и азбукой Морзе закодированных сообщений, что повышало уровень шифрования и безопасность связи.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Историческое значение:</h2> <ul className="list-disc ml-6 mb-4"> <li>Радиостанция «Север» широко применялась советскими разведчиками, партизанами и агентами в странах Европы, Азии и Латинской Америки.</li> <li>Позволяла поддерживать связь с Центром, передавать оперативные данные, координаты, пароли и инструкции, что было критически важно для успеха миссий.</li> <li>Использование радиостанции часто спасало жизни агентов, помогая организовать эвакуацию или изменить маршрут в случае опасности.</li> <li>Станция стала символом технологического прогресса и изобретательности советской разведки в условиях глобального противостояния.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Значение для музея шпионажа:</h2> <ul className="list-disc ml-6 mb-4"> <li>Экспонат наглядно демонстрирует, как технические средства обеспечивали безопасность и эффективность тайных операций в XX веке.</li> <li>Радио «Север» — пример миниатюризации и маскировки спецтехники, позволявшей вести скрытую связь в самых сложных условиях.</li> <li>Позволяет посетителям музея почувствовать атмосферу работы разведчика и оценить уровень технической подготовки агентов.</li> </ul> <blockquote className="italic text-gray-400 mt-4 p-5 bg-gray-700/10 rounded-lg"> «Радио “Север” было для нас окном в мир — оно связывало с Родиной и давало шанс на спасение» — воспоминания советского разведчика. </blockquote> <p className="mt-4"> Экспонат представлен в оригинальном исполнении и является уникальным свидетельством эпохи шпионских операций и технических достижений советской разведки. </p>
      </>
    ),
  },
  {
    model: "phone.glb",
    title: "Шпионский телефон",
    description: (
      <>
      <p> Шпионский телефон — специализированное устройство, разработанное для скрытой передачи информации и обеспечения защищённой связи между агентами и Центром. Внешне ничем не отличаясь от обычного телефонного аппарата, такие телефоны оснащались скрытыми микрофонами, системами записи или устройствами для перехвата и шифрования переговоров. Благодаря этим технологиям, телефон стал одним из ключевых инструментов шпионской деятельности в XX веке. </p> <h2 className="mt-4 mb-2 font-bold">Конструкция и характеристики:</h2> <ul className="list-disc ml-6 mb-4"> <li>Встроенный миниатюрный микрофон, позволяющий вести скрытую аудиозапись разговоров без ведома собеседника.</li> <li>Система передачи записей на внешние носители или по специальным каналам связи для последующего анализа в Центре.</li> <li>Механизмы шифрования голоса или передачи закодированных сообщений, что обеспечивало высокий уровень безопасности переговоров.</li> <li>В некоторых моделях — возможность дистанционного включения микрофона для прослушивания помещения даже при неиспользуемом телефоне.</li> <li>Компактность и маскировка под стандартные телефонные аппараты, что исключало подозрения со стороны посторонних лиц.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Историческое значение:</h2> <ul className="list-disc ml-6 mb-4"> <li>Шпионские телефоны широко применялись разведслужбами СССР, США и других стран для сбора компрометирующей информации и контроля над важными объектами.</li> <li>Использовались в дипломатических миссиях, посольствах, штаб-квартирах и на стратегических предприятиях для тайного мониторинга переговоров.</li> <li>Благодаря таким устройствам удавалось выявлять утечки информации, предотвращать диверсии и раскрывать шпионские сети противника.</li> <li>Телефоны с прослушкой стали символом эпохи технической разведки и информационных войн XX века.</li> </ul> <h2 className="mt-4 mb-2 font-bold">Значение для музея шпионажа:</h2> <ul className="list-disc ml-6 mb-4"> <li>Экспонат наглядно демонстрирует, как привычные предметы быта превращались в мощные инструменты разведки и контроля.</li> <li>Позволяет посетителям узнать о методах скрытого наблюдения и технических средствах обеспечения безопасности информации.</li> <li>Телефон-шпион — пример инноваций в области миниатюризации и маскировки, характерных для разведывательных технологий XX века.</li> </ul> <blockquote className="italic text-gray-400 mt-4 p-5 bg-gray-700/10 rounded-lg"> «Телефон на столе мог быть не только средством связи, но и окном для чужих ушей — так начиналась эра тотального контроля» — эксперт по истории технической разведки. </blockquote> <p className="mt-4"> Экспонат представлен в виде оригинального устройства и служит уникальным свидетельством технической изобретательности и скрытности шпионских операций XX века. </p> </>
    )
  }
];

function Spy() {
  const [curExhibition, setExhibition] = useState(0);

  return (
    <main className="flex flex-row w-[100vw] h-[100vh] bg-[#101010] relative">
      <div className="w-[40%] h-full p-10">
        <div className="w-full h-full bg-gradient-to-t from-gray-100/10 to-gray-400/10 rounded-[20px] max-lg:rounded-[10px] px-10 pb-10 flex flex-col transition">
          <h1 className="text-[64px] max-lg:text-[32px] w-full font-semibold text-[#DEE4EB] text-center underline pb-4 transition">
            {exhibitions[curExhibition].title}
          </h1>
          <section className="text-[16px] max-lg:text-[8px] text-[#DEE4EB] flex-1 overflow-y-auto transition">
            {exhibitions[curExhibition].description}
          </section>
        </div>
      </div>
      <div className="w-[60%] h-full relative">
        <button
          aria-label="Предыдущий экспонат"
          onClick={() => setExhibition(Math.max(curExhibition - 1, 0))}
          disabled={curExhibition === 0}
          className={`absolute w-10 h-10 text-[#DEE4EB]/20 text-4xl font-bold top-1/2 -translate-y-1/2 left-6 cursor-pointer z-40 ${curExhibition === 0 ? 'opacity-30 pointer-events-none' : ''}`}
        >{"<"}</button>
        <button
          aria-label="Следующий экспонат"
          onClick={() => setExhibition(Math.min(curExhibition + 1, exhibitions.length - 1))}
          disabled={curExhibition === exhibitions.length - 1}
          className={`absolute w-10 h-10 text-[#DEE4EB]/20 text-4xl font-bold top-1/2 -translate-y-1/2 right-6 cursor-pointer z-40 ${curExhibition === exhibitions.length - 1 ? 'opacity-30 pointer-events-none' : ''}`}
        >{">"}</button>
        <Canvas dpr={[1, 2]} shadows camera={{ fov: 45 }}>
          <color attach="background" args={["#101010"]} />
          <PresentationControls
            key={exhibitions[curExhibition].model}
            speed={1.5}
            global
            polar={[-0.2, 0.2]}
            rotation={[0, Math.PI + Math.PI / 4, 0]}
          >
            <Stage environment={"warehouse"} castShadow>
              <Suspense fallback={null}>
                <Model scale={0.005} model={`/${exhibitions[curExhibition].model}`} />
              </Suspense>
            </Stage>
          </PresentationControls>
        </Canvas>
      </div>
      <div className="absolute h-16 max-lg:h-8 left-1/2 -translate-x-1/2 bottom-10 rounded-[20px] bg-gradient-to-t from-gray-100/10 to-gray-400/10 flex flex-row items-center justify-center p-5">
        {exhibitions.map((_, i) => (
          <div
            key={i}
            className={`w-8 h-8 max-lg:w-4 max-lg:h-4 rounded-full mx-1 transition-all duration-200 ${
              curExhibition === i ? 'bg-gradient-to-t from-gray-100/30 to-gray-400/30' : 'bg-gradient-to-t from-gray-100/10 to-gray-400/10 scale-70'
            }`}
          />
        ))}
      </div>

      {/* Пример условного оверлея */}
      {/* {showOverlay && (
        <div className="absolute w-[100vw] h-[100vh] z-50 bg-gradient-to-t from-gray-500/90 to-gray-800/90 text-center flex items-center justify-center alert">
          <div className="text-red-600 font-bold text-[96px] max-sm:text-[48px]">PEREVERNI</div>
        </div>
      )} */}

      <Loader />
    </main>
  );
}

export default Spy;
